#ifndef __USART1_H
#define __USART1_H
/**
  ******************************************************************************
  * @file    STM32F407DEMO/usart1.c 
  * @author  Liang
  * @version V1.0.0
  * @date    2017-4-26
  * @brief   
  ******************************************************************************
  * @attention
	* 加入是否支持UCOS宏定义
	* 支持适应不同频率下的串口波特率设置.
	*	加入了对printf的支持
	* 增加了串口接收命令功能.
	* 修正了printf第一个字符丢失的bug
	* 修改串口初始化IO的bug
	* 修改了USART_RX_STA,使得串口最大接收字节数为2的14次方
	* 增加了USART_REC_LEN,用于定义串口最大允许接收的字节数(不大于2的14次方)
	* 修改了EN_USART1_RX的使能方式
	* 增加了对UCOSII的支持
  ******************************************************************************
**/

/* include-------------------------------------------------- */
#include "stm32f4xx_conf.h"
#include "sys.h" 

/* define--------------------------------------------------- */

void uart1_init(u32 bound);

#endif


